app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @pagy, @tweets = pagy(Tweet.all)

INSERT INTO "tweets" ("descripcion", "UserName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descripcion", ""], ["UserName", ""], ["created_at", "2023-07-01 02:56:15.708690"], ["updated_at", "2023-07-01 02:56:15.708690"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "UserName" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["UserName", "\"molestiae\", \"doloremque\", \"enim\""], ["updated_at", "2023-07-01 01:13:03.400670"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)